app/controllers/articles_controller.rb

  def index
  	@articles=Article.page(params[:page]).per(5)
---
SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"